In [1]:
import numpy as np
import pandas as pd

In [6]:
ps = pd.Series(range(5),index=['a','b','c','d','e'])
print(ps)
print(type(ps.index))

a    0
b    1
c    2
d    3
e    4
dtype: int64
<class 'pandas.core.indexes.base.Index'>

In [8]:
pd1 = pd.DataFrame(np.arange(9).reshape(3,3),index=['a','b','c'],columns=['A','B','C'])
print(pd1)
print(type(pd1.index))

   A  B  C
a  0  1  2
b  3  4  5
c  6  7  8
<class 'pandas.core.indexes.base.Index'>

In [9]:
#索引对象不可变，保证数据安全
#不能ps.index[0]=2
ps[0]=2
ps

a    2
b    1
c    2
d    3
e    4
dtype: int64

In [11]:
#索引基本操作
#重新索引  增删改查

#reindex
ps2 = ps.reindex(['a','b','c','d','e','f'])
ps2

a    2.0
b    1.0
c    2.0
d    3.0
e    4.0
f    NaN
dtype: float64

In [12]:
pd2 = pd1.reindex(['a','b','c','d'])
pd2

     A    B    C
a  0.0  1.0  2.0
b  3.0  4.0  5.0
c  6.0  7.0  8.0
d  NaN  NaN  NaN

In [13]:
#df列索引重建
pd3 = pd1.reindex(columns = ['C','B','A'])
pd3

   C  B  A
a  2  1  0
b  5  4  3
c  8  7  6

In [15]:
#增
ps

a    2
b    1
c    2
d    3
e    4
dtype: int64

In [17]:
ps['g']=9
ps

a    2
b    1
c    2
d    3
e    4
g    9
dtype: int64

In [19]:
s1 = pd.Series({'f':999})
ps3 = ps.append(s1)
ps3

a      2
b      1
c      2
d      3
e      4
g      9
f    999
dtype: int64

In [20]:
pd1[4] = 9
pd1

   A  B  C  4
a  0  1  2  9
b  3  4  5  9
c  6  7  8  9

In [21]:
pd1.insert(0,'E',[9,99,999])
pd1

     E  A  B  C  4
a    9  0  1  2  9
b   99  3  4  5  9
c  999  6  7  8  9

In [22]:
#标签索引loc 行索引
pd1.loc['d']=[1,1,1,1,1]
pd1

     E  A  B  C  4
a    9  0  1  2  9
b   99  3  4  5  9
c  999  6  7  8  9
d    1  1  1  1  1

In [24]:
row = {'E':66,'A':6,'B':6,'C':4,4:7}
pd5 = pd1.append(row,ignore_index=True)#忽略掉原先的index
pd5

     E  A  B  C  4
0    9  0  1  2  9
1   99  3  4  5  9
2  999  6  7  8  9
3    1  1  1  1  1
4   66  6  6  4  7

In [26]:
#删
ps

a    2
b    1
c    2
d    3
e    4
g    9
dtype: int64

In [33]:
del pd1['E']
pd1

   A  B  C  4
a  0  1  2  9
b  3  4  5  9
c  6  7  8  9
d  1  1  1  1

In [37]:
#drop 不改变原数据
ps6 = ps.drop('g')
ps6

c    2
d    3
e    4
dtype: int64

In [38]:
ps.drop(['c','d'])

e    4
g    9
dtype: int64

In [39]:
pd1.drop('a')

   A  B  C  4
b  3  4  5  9
c  6  7  8  9
d  1  1  1  1

In [40]:
pd1.drop('A',axis=1)#删除列

   B  C  4
a  1  2  9
b  4  5  9
c  7  8  9
d  1  1  1

In [41]:
#inplace在原对象删除 不返回新对象
ps.drop('g',inplace=True)
ps

c    2
d    3
e    4
dtype: int64

In [43]:
#改
ps1 = pd.Series(range(5),index=['a','b','c','d','e'])
pd1 = pd.DataFrame(np.arange(9).reshape(3,3),index=['a','b','c'],columns=['A','B','C'])
ps1

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [44]:
ps1['a'] = 999
ps1

a    999
b      1
c      2
d      3
e      4
dtype: int64

In [45]:
pd1['A'] = 99
pd1

    A  B  C
a  99  1  2
b  99  4  5
c  99  7  8

In [46]:
pd1.A = 6
pd1

   A  B  C
a  6  1  2
b  6  4  5
c  6  7  8

In [47]:
pd1.loc['a']=777
pd1

     A    B    C
a  777  777  777
b    6    4    5
c    6    7    8

In [48]:
pd1.loc['a','A']=1000
pd1

      A    B    C
a  1000  777  777
b     6    4    5
c     6    7    8

In [49]:
#查
#行索引
ps1

a    999
b      1
c      2
d      3
e      4
dtype: int64

In [50]:
ps1['a']

999

In [51]:
ps1[0]

999

In [52]:
#切片索引
ps1[1:4]

b    1
c    2
d    3
dtype: int64

In [53]:
ps1[['b','e']]

b    1
e    4
dtype: int64

In [54]:
#布尔索引
ps1[ps1>2]

a    999
d      3
e      4
dtype: int64

In [55]:
#df
pd1

      A    B    C
a  1000  777  777
b     6    4    5
c     6    7    8

In [56]:
pd1['A']

a    1000
b       6
c       6
Name: A, dtype: int64

In [59]:
pd1[['A','C']]

      A    C
a  1000  777
b     6    5
c     6    8

In [60]:
pd1['A']['a']#用loc是先行后列

1000

In [61]:
pd1[:2]#前两行

      A    B    C
a  1000  777  777
b     6    4    5

In [62]:
#高级索引
#loc
ps1

a    999
b      1
c      2
d      3
e      4
dtype: int64

In [63]:
ps1.loc['a':'c']

a    999
b      1
c      2
dtype: int64

In [64]:
pd1

      A    B    C
a  1000  777  777
b     6    4    5
c     6    7    8

In [66]:
pd1.loc['a':'b','A']

a    1000
b       6
Name: A, dtype: int64

In [67]:
#iloc 位置索引
ps1[1:3]

b    1
c    2
dtype: int64

In [68]:
ps1.iloc[1:3]

b    1
c    2
dtype: int64

In [69]:
pd1.iloc[0:2,0]

a    1000
b       6
Name: A, dtype: int64